package com.example.tales;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.GridLayoutManager;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.ImageView;
import android.widget.RelativeLayout;

import java.util.ArrayList;

public class myth extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_myth);
        final ImageView hand = findViewById(R.id.imageView8);


///////
        hand.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent gotomain2 = new Intent(myth.this,MainActivity2.class);
                startActivity(gotomain2);
            }
        });
       ///////////



        ArrayList<legends> mylegend = new ArrayList<>();
        legends legend1 = new legends("احادي القرن ",R.drawable.unicornzoom,R.drawable.un,"ذكر في الاساطير الاغريقية ان احادي القرن هو عباره عن كائن خرافي على هيئة حصان ابيض اللون ذو قرن واحد نابت من جبهته .\n" +
                "اما اساطير أوروبا وامريكا فصورته على انه كائن خيالي ذو جسد ورأس حصان وارجل أيل ويمتلك قرن نابت من جبهته وذيله يشبه ذيل الأسد. \n" +
                "يعتبر احادي القرن مخلوق شديد الشراسة فهو سريع للغاية وقرنه حاد مما يجعله ند للأسود والتنانين . \n" +
                "عرف بأنهم مخلوقات منفردة يتقابلون فقط من اجل هدف واحد وهو التزاوج . اما اشهر ما قيل عن احادي القرن  هو قدرته على الشفاء لذلك يتم اصطياده وذبحة لصنع اواني واكواب من قرونهم ويعتقد أيضا ان كبد احادي القرن تشفي من الجذام");
        legends legend2 = new legends("التنين",R.drawable.dragonzoom,R.drawable.dr,"التنين الصيني هو كائن أسطوري ذكر في التراث الشعبي الصيني. يتميز شكلة بانة طويل وافعواني ذو قشور ويمتللك أربعة أرجل. يقال بان التنين هو يانغ الذي يتمم ين وهو فنغهوانغ (\"طائر الفونيكس الصيني\"). \n" +
                "\n" +
                "يرمز التنين الصيني إلى السلطان والقوة والحظ، ويعرف بانه يتحكم في المياه والأمطار والأعاصير والفيضانات. \n" +
                "\n" +
                "\n" +
                "اما اوروبا فقد صورت التنين على انه مخلوق ينفث النار ويحمل دلالات عدوانية، ويمتلك اجنحة على خلاف التنين الصيني ويسكن في الكهوف والجبال ويقال بانهم ينجذبون للذهب \n" +
                "\n" +
                "\n");
        legends legend3 = new legends("العنقاء ",R.drawable.phoenixzoom,R.drawable.ph,"العنقاء ويطلق عليه الطائر الناري وهو طائر ضخم ذو ريش لونه ذهبي وارجواني ويرمز هذه الطائر للخلود و الشمس المشرقة. العنقاء لايحتاج الى طعام لاعاله نفسه على الرغم من انه معروف بانه ياكل علك اللبان . يقال بان هناك طائر عنقاء واحد يعيش لمدة قرن كامل ثم يبني عش وهناك يحرق نفسه من خلال عكس اشعه الشمس على ريشه لاشعال النيران باجنحته و بعد تسع ايام يولد طائر عنقاء اخر من رماد الطائر السابق . \n" +
                "\n" +
                "< يقال ان حدث وراه شخص فسيعم السلام والاستقرار في بلدة > ");
        legends legend4 = new legends("القنطور",R.drawable.centaurzoom,R.drawable.ce,"هو مخلوق أسطوري في الميثولوجيا الإغريقية له جسد حصان و جذع وراس إنسان ، تقول الأسطورة أن هذا المخلوق كان يعيش في الغابات و على الجبال وانه عباره عن كائن بري لايلتزم بقانون وهو عدواني للغاية وعبد لرغبته الحيوانيه ،. و مخمور طوال الوقت . ولاكن بعض القناطير عرفت بمحبتها للفلسفة وعلم الفلك .");

        legends legend5 = new legends("الجنيات",R.drawable.fairyzoom,R.drawable.fa,"هي عبارة عن مخلوقه اسطوريه مذكوره في التراث الشعبي للعديد من الدول ،وبضمنه الأوروبي. وصفت الجنيات على انها كائنات في غاية الجمال، بيضاء جدا، وفي الغالب تتواجد بالقرب من الغابات والمياه. الأساطير والقصص حول الجنيات ليس لها أصل واحد، ولكنها بالأحرى مجموعة من المعتقدات الشعبية من مصادر متباينة. في بعض الأحيان، لا ينطبق اسم الجنية إلا على مخلوقات سحرية محددة ذات مظهر بشري، وقامة صغيرة، وقوى سحرية، وميل إلى الخداع. وفي أحيان أخرى قد تم استخدامها لوصف أي مخلوق سحري، مثل العفاريت والتماثيل. وقد استخدمت الجنية في بعض الأحيان كصفة");
        legends legend6 = new legends("الغريفين",R.drawable.griffinzoom,R.drawable.gr,"هو عباره عن مخلوق اسطوري نادر له جسم اسد (ملك الوحوش) ورأس وجناحي عقاب (ملك الهواء)بالعاده يكون ريشه باللون البني ولكن البعض له ريش ذو لمعان ازرق داكن يقال بان العديد من الغريفين هاجر من الشرق الاوسط الى اوربا في القرن الثالث عشر ولاكن لايزال معضمهم يسكنون الصحراء . يعيش الغريفين في الاماكن المرتفعه لذلاك بالعادة يتم رصدها فقط عندما تطير بحثا عن الطعام .يبلغ حجم الغريفين البالغ حجم الاسد تقريبا ولاكنه اقوى بكثير. يقال بانه الغريفين مقاوم لسم التنانين ومعادية للخيول . فلذلك يعتبر ذريه الغريفين و الخيول رمز لقوة الحب .");

        legends legend7 = new legends("الرجل الجليدي",R.drawable.yetizoom,R.drawable.ye,"هو مخلوق خرافي يشاع بأنه يعيش في جبل ايفيرست ، وجبال أخرى من سلسلة جبال الهيمالايا بقارة اسيا. جاءت تقارير حول مخلوقٍ كهذا أيضًا من أطراف بعيدة بالصين ، الاتحاد السوفيتي.واستنادًا إلى الخرافة فإن الإنسان الجليدي وحش كثيف الشعر ذو جثة هائلة تشبه جثة القرد، ووجهه أشبه بوجه الإنسان، وله ذراعان طويلتان تصلان إلى ركبتيه، ويمشي منتصبًا على قدميه الضخمتين. تقول الخرافة: إن الإنسان الجليدي يهبط أحيانًا من الجبال كي يشنَّ غارات على القرويين");
        legends legend8 = new legends("الكابا",R.drawable.kappazoom,R.drawable.ka,"الكابا هو عباره عن وحش اسطوري ذكر باليابان يقال انه يعيش في البرك والانهار . مظهر هذه الوحش شبية بالانسان والزواحف . بالعاده الكابا يمتلك جسم طفل ولاكنه اقوى جسديا من الرجل البالغ ويتميز بلون اخضر او اصفر وله صدفة على ظهره تشبه صدفة السلحفاة وعلى الرغم من امتلاكة لمنقار الا انه يستطيع التحدث بلغة البشر . اهم مافي الكابا هو السارا وهو عباره عن تجويف يوجد برأس الكابا ممتلىء بالماء والذي يعتبر مصدر قوة الكابا لذلك يكون هذه التجويف دائما ممتلىء عند خروج الكابا من الماء فاذا جف او انسكب سوف يفقد قوته ومن الممكن ان يموت .. يعرف الكابا بحبة للاذى فهم يحاولون اغراق الماشية وخطف الاطفال لالتهامهم ويمتلك الكابا معرفه كبيرة بعلم الطب .... ");
        legends legend9 = new legends("حوريات البحر ",R.drawable.mermaidzoom,R.drawable.mer,"حورية البحر او عرائس البحر كائنات تسكن البحار والبحيرات على ما تفيد الأساطير. وتصورها على أنها كائنات تجمع بين صفات البشر والأسماك. فالقسم العلوي يتمتع بكامل صفات البشر العلوية من الرأس الى السرة بينما القسم السفلي يتمتع بجسم سمكي الى الذيل. \n" +
                "\n" +
                "والأساطير عادة ما تصور حوريات البحر على أنها مخلوقات جميلة وساحرة ووصفت ايضا بالشر حيث ان حوريات البحر يخطفن بني البشر و يحتجزنه و يسرقن روحه ببطئ ليعشن للابد \n" +
                "\n");
        legends legend10 = new legends("الغوبلن",R.drawable.goblinzoom,R.drawable.go,"هي كائنات خيالية أسطورية، ترمز للشر.عادةً ما يُصوَّر الغوبلن مع قدراتٍ عديدةٍ وشخصيات وهيئاتٍ مختلفة، اعتماداً على الثقافة أو البلد الذي يتناولهم. وفي بعض الحالات يصور الغوبلن بهيئة كائناتٍ صغيرة مثيرة للإزعاج، بالغالب يكون الغوبلن مخلوقات قصيرة القامة، حيث لا يزيد طولهم عن بضعة إنشات، بل وأحياناً يكونون بطول الاقزام حتى. وأما شخصياتهم فكثيراً ما تكون مزعجة وفضولية، وغالباً ما يتّسمون بقدراتٍ مميزة، من أبرزها القدرات السحرية، أو المهارات الميكانيكية في التعامل مع الآلات. ");
legends legend11 = new legends("نيان",R.drawable.zoomnian,R.drawable.nian,
        "نيان عباره عن مخلوق اسطوري نصفه تنين والنصف الاخر احادي قرن . يقال بان هذه الوحش يعيش في البحر والجبال . يخرج  نيان كل سنه صينية جديدة ويهاجم الناس ووفقا للاسطورة فأن هذه الوحش يكره الاصوات الصاخبة واللون الاحمر . \n" +
        "\n" +
        "لذلك كل سنه صينية جديدة تحتفل الصين بمجموعه من الالعاب النارية لتخويف الوحش . ");
        legends legend12 = new legends("الهيدرا",R.drawable.zoomhedra,R.drawable.hedra,"الهيدرا هو كائن اسطوري سكن في مستنقع ليرنا في اليونان يمتلك هذه الوحش تسعه رؤوس واحد منها فقط خالد ولا يموت تستطيع هذه الرؤوس ان تهاجم في ان واحد لعدة اهداف مشتركة او منفصلة لذلك يعتبر الهيدرا بقوة تسع وحوش مجتمعين بجسد واحد جميع هذه الرؤوس تستطيع ان تنفث السم . وعند قطع احد هذه الرؤوس ينبت اثنان عوضا عن الرأس الذي قطع . الشكل الأكثر شيوعا لهذا الوحش هو تنين بأربعة اقدام ، وجسد واحد اضافة إلى ذيل قوي طويل وعلى خلاف التنين لا تمتلك الهيدرا اجنحة ولا تستطيع أن تنفث النار لذلك لا تعتبر من التنانين و في بعض الروايات يقال بان الهيدرا تمتلك زعانف.");
legends legend13 = new legends("الكايميرا ",R.drawable.chimerazoom,R.drawable.chimera,

        "الكايميرا هو عباره عن مخلوق أسطوري هجين، مشهور في الأساطير اليونانية القديمة، مكون من ثلاثة حيوانات، رأس أسد مع رأس وجسم ماعز وذيل افعى . ويتميز الكايميرا بقدرته على نفخ النيران. كان هذه الوحش سبب خوف ورعب اهل منطقة lycia حيث كان يقتل ابنائهم و يحرق اراضي القرية والتلال والوديان الواقعة حولها .");


        mylegend.add(legend1);
        mylegend.add(legend2);
        mylegend.add(legend3);
        mylegend.add(legend4);

        mylegend.add(legend5);
        mylegend.add(legend6);


        mylegend.add(legend7);
        mylegend.add(legend8);
        mylegend.add(legend9);
        mylegend.add(legend10);

        mylegend.add(legend11);
        mylegend.add(legend12);
        mylegend.add(legend13);


        RecyclerView rvmyth = findViewById(R.id.RV1);

        rvmyth.setHasFixedSize(true);
        RecyclerView.LayoutManager lmmyth = new GridLayoutManager(this,3);
        rvmyth.setLayoutManager(lmmyth);

        adaptermyth adapter = new adaptermyth(mylegend,this);
        rvmyth.setAdapter(adapter);






        /////
    }
}